## Grouping Sets and Pivoting Data

***

### Import Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import random

import pyodbc

%matplotlib inline

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.option_context('float_format','{:.2f}'.format)

random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

## Load Data from SQL database

### MSSQL

In [2]:
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=DESKTOP-ARQLULI\SQLEXPRESS2019;'
                      'Database=AdventureWorksLT2012;'
                      'Trusted_Connection=yes;')

## Challenge 1: Retrieve Regional Sales Totals

In [3]:
pd.read_sql_query("SELECT a.CountryRegion, a.StateProvince, SUM(soh.TotalDue) AS Revenue \
                   FROM SalesLT.Address AS a \
                   JOIN SalesLT.CustomerAddress AS ca \
                   ON a.AddressID = ca.AddressID \
                   JOIN SalesLT.Customer AS c \
                   ON ca.CustomerID = c.CustomerID \
                   JOIN SalesLT.SalesOrderHeader as soh \
                   ON c.CustomerID = soh.CustomerID \
                   GROUP BY ROLLUP(a.CountryRegion, a.StateProvince) \
                   ORDER BY a.CountryRegion, a.StateProvince;", conn)

    CountryRegion StateProvince      Revenue
0            None          None  956303.5949
1  United Kingdom          None  572496.5594
2  United Kingdom       England  572496.5594
3   United States          None  383807.0355
4   United States    California  346517.6072
5   United States      Colorado   14017.9083
6   United States        Nevada    7330.8972
7   United States    New Mexico   15275.1977
8   United States          Utah     665.4251

In [4]:
pd.read_sql_query("SELECT a.CountryRegion, a.StateProvince,\
                   IIF(GROUPING_ID(a.CountryRegion) = 1 AND GROUPING_ID(a.StateProvince) = 1, 'Total', IIF(GROUPING_ID(a.StateProvince) = 1, a.CountryRegion + ' Subtotal', a.StateProvince + ' Subtotal')) AS Level,\
                   SUM(soh.TotalDue) AS Revenue \
                   FROM SalesLT.Address AS a \
                   JOIN SalesLT.CustomerAddress AS ca \
                   ON a.AddressID = ca.AddressID \
                   JOIN SalesLT.Customer AS c \
                   ON ca.CustomerID = c.CustomerID \
                   JOIN SalesLT.SalesOrderHeader as soh \
                   ON c.CustomerID = soh.CustomerID \
                   GROUP BY ROLLUP(a.CountryRegion, a.StateProvince) \
                   ORDER BY a.CountryRegion, a.StateProvince;", conn)

    CountryRegion StateProvince                    Level      Revenue
0            None          None                    Total  956303.5949
1  United Kingdom          None  United Kingdom Subtotal  572496.5594
2  United Kingdom       England         England Subtotal  572496.5594
3   United States          None   United States Subtotal  383807.0355
4   United States    California      California Subtotal  346517.6072
5   United States      Colorado        Colorado Subtotal   14017.9083
6   United States        Nevada          Nevada Subtotal    7330.8972
7   United States    New Mexico      New Mexico Subtotal   15275.1977
8   United States          Utah            Utah Subtotal     665.4251

In [5]:
pd.read_sql_query("SELECT a.CountryRegion, a.StateProvince, a.City,\
                   CHOOSE (1 + GROUPING_ID(a.CountryRegion) + GROUPING_ID(a.StateProvince) + GROUPING_ID(a.City),\
                           a.City + ' Subtotal', a.StateProvince + ' Subtotal',\
                           a.CountryRegion + ' Subtotal', 'Total') AS Level,\
                   SUM(soh.TotalDue) AS Revenue\
                   FROM SalesLT.Address AS a\
                   JOIN SalesLT.CustomerAddress AS ca\
                   ON a.AddressID = ca.AddressID\
                   JOIN SalesLT.Customer AS c\
                   ON ca.CustomerID = c.CustomerID\
                   JOIN SalesLT.SalesOrderHeader as soh\
                   ON c.CustomerID = soh.CustomerID\
                   GROUP BY ROLLUP(a.CountryRegion, a.StateProvince, a.City)\
                   ORDER BY a.CountryRegion, a.StateProvince, a.City;", conn)

     CountryRegion StateProvince             City                     Level      Revenue
0             None          None             None                     Total  956303.5949
1   United Kingdom          None             None   United Kingdom Subtotal  572496.5594
2   United Kingdom       England             None          England Subtotal  572496.5594
3   United Kingdom       England         Abingdon         Abingdon Subtotal      45.1995
4   United Kingdom       England        Cambridge        Cambridge Subtotal    2711.4098
5   United Kingdom       England  Gloucestershire  Gloucestershire Subtotal   70698.9922
6   United Kingdom       England     High Wycombe     High Wycombe Subtotal     608.1766
7   United Kingdom       England        Liverpool        Liverpool Subtotal   86222.8072
8   United Kingdom       England           London           London Subtotal  206736.1667
9   United Kingdom       England       Maidenhead       Maidenhead Subtotal      43.0437
10  United Kingdom       England    Milton Keynes    Milton Keynes Subtotal   41759.6651
11  United Kingdom       England             Oxon             Oxon Subtotal    1170.5376
12  United Kingdom       England      West Sussex      West Sussex Subtotal   42452.6519
13  United Kingdom       England        Wokingham        Wokingham Subtotal      87.0851
14  United Kingdom       England         Woolston         Woolston Subtotal  119960.8240
15   United States          None             None    United States Subtotal  383807.0355
16   United States    California             None       California Subtotal  346517.6072
17   United States    California         Alhambra         Alhambra Subtotal     117.7276
18   United States    California           Auburn           Auburn Subtotal     972.7850
19   United States    California        Camarillo        Camarillo Subtotal    2361.6403
20   United States    California         Cerritos         Cerritos Subtotal   45992.3665
21   United States    California      Culver City      Culver City Subtotal     272.6468
22   United States    California        Daly City        Daly City Subtotal    3293.7761
23   United States    California       El Segundo       El Segundo Subtotal    2669.3183
24   United States    California        Fullerton        Fullerton Subtotal   81834.9826
25   United States    California           Oxnard           Oxnard Subtotal    5016.4173
26   United States    California        Santa Ana        Santa Ana Subtotal    3673.3249
27   United States    California     Sherman Oaks     Sherman Oaks Subtotal   63686.2708
28   United States    California       Union City       Union City Subtotal   92663.5609
29   United States    California         Van Nuys         Van Nuys Subtotal   43962.7901
30   United States      Colorado             None         Colorado Subtotal   14017.9083
31   United States      Colorado        Englewood        Englewood Subtotal   14017.9083
32   United States        Nevada             None           Nevada Subtotal    7330.8972
33   United States        Nevada        Las Vegas        Las Vegas Subtotal    7330.8972
34   United States    New Mexico             None       New Mexico Subtotal   15275.1977
35   United States    New Mexico         Santa Fe         Santa Fe Subtotal   15275.1977
36   United States          Utah             None             Utah Subtotal     665.4251
37   United States          Utah            Sandy            Sandy Subtotal     665.4251

## Challenge 2: Retrieve Customer Sales Revenue by Category

In [6]:
pd.read_sql_query("SELECT * FROM \
                   (SELECT cat.ParentProductCategoryName, cust.CompanyName, sod.LineTotal\
                    FROM SalesLT.SalesOrderDetail AS sod \
                    JOIN SalesLT.SalesOrderHeader AS soh ON sod.SalesOrderID = soh.SalesOrderID \
                    JOIN SalesLT.Customer AS cust ON soh.CustomerID = cust.CustomerID \
                    JOIN SalesLT.Product AS prod ON sod.ProductID = prod.ProductID \
                    JOIN SalesLT.vGetAllCategories AS cat ON prod.ProductcategoryID = cat.ProductCategoryID) AS catsales\
                   PIVOT (SUM(LineTotal) FOR ParentProductCategoryName \
                   IN ([Accessories], [Bikes], [Clothing], [Components])) AS pivotedsales \
                   ORDER BY CompanyName;",conn)

                        CompanyName  Accessories         Bikes     Clothing  Components
0        Action Bicycle Specialists  1299.885268  76613.651796  2461.657250    9494.082
1          Aerobic Exercise Company          NaN           NaN          NaN    1732.890
2               Bulk Discount Store   730.464000  70597.284000   851.562000    1980.918
3       Central Bicycle Specialists          NaN           NaN          NaN      31.584
4                    Channel Outlet   216.000000           NaN   308.664000         NaN
5             Closest Bicycle Store          NaN  20389.668000   559.164108    8001.846
6            Coalition Bike Company          NaN    529.492800   124.776000    1201.938
7                    Discount Tours    72.000000   2041.188000   341.058000      72.882
8         Eastside Department Store  1220.235601  51096.054808  2772.229577   10594.848
9           Engineered Bike Systems          NaN   2604.762000   178.746000      63.900
10             Essential Bike Works          NaN           NaN    37.758000         NaN
11          Extreme Riding Supplies          NaN  41337.936000          NaN    6510.090
12                 Futuristic Bikes          NaN           NaN   174.288000      46.968
13                        Good Toys          NaN           NaN          NaN     713.796
14    Instruments and Parts Company          NaN  50771.952000          NaN    2476.740
15                 Many Bikes Store   770.700000  49800.595200  1659.378000    7663.536
16      Metropolitan Bicycle Supply    20.994000  50339.739600  1149.044424   28079.838
17                Nearby Cycle Shop    32.994000  25125.708000   545.922000    4218.384
18      Paints and Solvents Company          NaN  10364.292000   156.858000      63.900
19   Professional Sales and Service   914.514000  27329.094000  1233.084000    3843.294
20            Remarkable Bike Store          NaN   5426.964000    82.610908      24.294
21                    Riding Cycles  1608.599143  51328.242000  2533.150275    9653.472
22            Sports Products Store    20.994000   2640.564000    66.997076      48.588
23                     Sports Store          NaN    991.186800          NaN     893.208
24      Tachometers and Accessories          NaN   1376.994000   335.952000         NaN
25  The Bicycle Accessories Company     2.994000           NaN    93.114824         NaN
26          Thrifty Parts and Sales          NaN           NaN    10.788000     916.128
27             Thrilling Bike Tours     4.770000  11188.278000   140.958000     194.838
28              Trailblazing Sports          NaN  22272.501600   269.958000   11576.076
29                  Transport Bikes          NaN    445.410000          NaN      54.894
30            Vigorous Sports Store          NaN           NaN          NaN     858.900
31                   West Side Mart          NaN           NaN          NaN      63.900

In [7]:
conn.close()

#### Python code done by Dennis Lam